"""
Task6
По длинам трех отрезков, введенных пользователем, определить возможность существования треугольника,
составленного из этих отрезков. Если такой треугольник существует,
то определить, является ли он разносторонним, равнобедренным или равносторонним.
"""
a = float(input('Введите a: '))
b = float(input('Введите b: '))
c = float(input('Введите c: '))

if a + b > c and a + c > b and b + c > a:
    if a == b and a == c:
        print('Треугольник равносторонний')
    elif a == b or a == c or b == c:
        print('Треугольник равнобедренный')
    else:
        print('Треугольник разносторонний')
else:
    print('Треугольника с такими сторонами не существует')
